app/Http/Controllers/AuthController.php

    public function login(Request $request) {
        $request->validate([
            'email'=>'email|required',
            'password'=>'required',
        ]);

        $credentials = request(['email', 'password']);
        if (!auth()->attempt($credentials)) {
            return response()->json([
                'message' => 'The given data is invalid',
                'errors' => [
                    'E-mail' => [
                        'Netočni email ili zaporka'
                    ],
                ]
            ], 422);
        }

        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'ciras@gmail.com' limit 1

    public function getUser(Request $request) {
        $authUser = auth()->user();
        $user = User::find($authUser->id);
---
select * from `users` where `users`.`id` = 8 limit 1