app/Http/Controllers/RoleController.php

select * from `roles`
---
    public function index()
    {
        //
        return Role::all();