app/Http/Controllers/ServiceController.php

    public function index()
    {
        return Service::with('children')->whereNull('parent_id')->get();
---
select * from `services` where `services`.`parent_id` in (1, 2, 3)