app/Http/Controllers/UserController.php

    public function index()
    {
        $users = User::with('role')->get();
---
select * from `roles` where `roles`.`id` in (1, 3)
select * from `users`